[{
  "url": "https://www.allrecipes.com/recipe/16346/maries-easy-slow-cooker-pot-roast/",
  "name": "Slow Cooker Pot Roast",
  "rating": "4.6",
  "ratingcount": "2",
  "ingredients": "4 pounds chuck roast; salt and pepper to taste; 2 tablespoons olive oil; 1 packet dry onion soup mix; 1 cup water; 3  carrots, chopped; 3  potatoes, peeled and cubed; 1  onion, chopped; 1 stalk celery, chopped",
  "directions": "1. Season chuck roast with salt and pepper. Heat oil in a large skillet over high heat; add roast and sear to brown, about 4 minutes per side. 2. Place roast in the slow cooker and sprinkle soup mix on top. Add water, and scatter carrots, potatoes, onion, and celery on top. 3. Cover and cook on Low for 8 to 10 hours.",
  "prep": "20 mins",
  "cook": "8 hrs 20 mins",
  "total": "8 hrs 40 mins",
  "calories": "540"
},
{
  "url": "https://www.allrecipes.com/recipe/11758/baked-ziti-i/",
  "name": "Baked Ziti",
  "rating": "4.7",
  "ratingcount": "8",
  "ingredients": "1 pound dry ziti pasta; 1  onion, chopped; 1 pound lean ground beef; 2 (26 ounce) jars spaghetti sauce; 6 ounces provolone cheese, sliced; 1 ½ cups sour cream; 6 ounces mozzarella cheese, shredded; 2 tablespoons grated Parmesan cheese",
  "directions": "1. Bring a large pot of lightly salted water to a boil. Add ziti pasta, and cook until al dente, about 8 minutes; drain. 2. Meanwhile, brown ground beef and onion in a large skillet over medium heat; stir in spaghetti sauce and simmer for 15 minutes. 3. Preheat the oven to 350 degrees F (175 degrees C). Butter a 9x13-inch baking dish. 4. Spread 1/2 of the ziti in the bottom of the prepared dish; top with Provolone cheese, sour cream, 1/2 of the meat sauce, remaining ziti, mozzarella cheese, and remaining meat sauce. Top with grated Parmesan cheese. 5. Bake in the preheated oven until heated through and cheeses have melted, about 30 minutes.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr",
  "calories": "578"
},
{
  "url": "https://www.allrecipes.com/recipe/262181/cast-iron-pan-seared-steak-oven-finished/",
  "name": "Cast Iron Pan-Seared Steak (Oven-Finished)",
  "rating": "4.4",
  "ratingcount": "59",
  "ingredients": "2 (6 ounce) beef top sirloin steaks; 2 cups orange juice; 1 cup apple cider vinegar; ½ cup Worcestershire sauce; 1 ½ tablespoons steak seasoning (such as Fiesta Brand® Uncle Chris'), or to taste; freshly ground black pepper to taste; 2 teaspoons olive oil; sea salt to taste",
  "directions": "1. Gather all ingredients. 2. Place steaks side by side in large casserole dish. Add orange juice, cider vinegar, and Worcestershire sauce. 3. Marinate, uncovered, in the refrigerator for 45 minutes. 4. Preheat the oven to 425 degrees F (220 degrees C). 5. Remove casserole dish from refrigerator. Cover steaks with plastic wrap and let allow to come to room temperature, at least 15 minutes. 6. Place steaks on a clean work surface and generously rub with steak seasoning and black pepper. 7. Heat olive oil in a cast-iron skillet over high heat. 8. Cook steaks in the hot skillet until lightly browned on the bottom, 2 1/2 minutes. 9. Flip and cook until browned on the other side and red in the center, about 2 minutes more. 10. Transfer skillet with the steaks to the oven. 11. Bake in the preheated oven until steaks are firm and reddish-pink to lightly pink in the center, 8 to 10 minutes. An instant-read thermometer inserted into the center should read from 130 degrees F (54 degrees C) to 140 degrees F (60 degrees C). 12. Remove steaks from oven; season with salt. Let rest for 5 minutes before serving. 13. Enjoy!",
  "prep": "5 mins",
  "cook": "13 mins",
  "total": "1 hr 23 mins",
  "calories": "457"
},
{
  "url": "https://www.allrecipes.com/recipe/14595/salisbury-steak/",
  "name": "Salisbury Steak",
  "rating": "4.4",
  "ratingcount": "4",
  "ingredients": "1 ½ pounds ground beef; 1 (10.5 ounce) can condensed French onion soup; ½ cup dry bread crumbs; 1  egg; ¼ teaspoon salt; ⅛ teaspoon ground black pepper; 1 tablespoon all-purpose flour; ¼ cup ketchup; ¼ cup water; 1 tablespoon Worcestershire sauce; ½ teaspoon mustard powder",
  "directions": "1. Combine ground beef, 1/3 cup condensed soup, bread crumbs, egg, salt, and black pepper in a large bowl. Shape into 6 oval patties. 2. Heat a large skillet over medium-high heat; add patties and brown on both sides. Drain excess fat. 3. Blend remaining soup and flour together in a small bowl until smooth; mix in ketchup, water, Worcestershire sauce, and mustard. Pour soup mixture over patties in the skillet. Cover, and cook for 20 minutes, stirring occasionally.",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "40 mins",
  "calories": "440"
},
{
  "url": "https://www.allrecipes.com/recipe/222037/tater-tots-r-casserole/",
  "name": "Tater Tot Casserole",
  "rating": "4.5",
  "ratingcount": "575",
  "ingredients": "1 pound ground beef; 1 (10.5 ounce) can condensed cream of mushroom soup; salt and ground black pepper to taste; 1 (16 ounce) package frozen tater tots; 2 cups shredded Cheddar cheese",
  "directions": "1. Gather the ingredients. Preheat the oven to 350 degrees F (175 degrees C). 2. Heat a large skillet over medium-high heat. Cook and stir ground beef in the hot skillet until completely browned and crumbly, 7 to 10 minutes. Stir in condensed soup; season with salt and black pepper. 3. Transfer beef mixture to a 9x13-inch baking dish; layer tater tots evenly on top and sprinkle with Cheddar cheese. 4. Bake in the preheated oven until tater tots are golden brown and hot, 30 to 45 minutes. 5. Serve and enjoy!",
  "prep": "5 mins",
  "cook": "40 mins",
  "total": "45 mins",
  "calories": "345"
},
{
  "url": "https://www.allrecipes.com/recipe/74360/the-best-meatloaf-ive-ever-made/",
  "name": "Best Meatloaf",
  "rating": "4.5",
  "ratingcount": "1",
  "ingredients": "1 tablespoon butter; ¼ cup minced onion; 2 cloves garlic, minced; 1 ½ teaspoons salt; 1 ½ teaspoons freshly ground black pepper; 2 pounds extra-lean ground beef; 3 slices bread, toasted and crumbled; 7  buttery round crackers, crushed; 1  egg, lightly beaten; 3 ½ tablespoons sour cream; 1 ½ tablespoons Worcestershire sauce; 1 (15 ounce) can tomato sauce, divided; ¼ cup milk, or as needed (Optional); 3 tablespoons ketchup",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Gather all ingredients. 2. Melt butter in a skillet over medium heat, and cook onion and garlic until onion is soft and translucent, about 5 minutes. Remove from heat, and season with salt and pepper. 3. Combine onion and garlic mixture, beef, crumbled bread, crushed crackers, egg, sour cream, Worcestershire sauce, and 1/2 can tomato sauce in a large bowl. Mix until well combined. Gradually stir in milk, 1 teaspoon at a time, until mixture is moist, but not soggy. 4. Transfer the mixture to a 5x9-inch loaf pan. 5. Bake uncovered in the preheated oven for 40 minutes. Increase oven temperature to 400 degrees F (200 degrees C). Continue baking 15 minutes, to an internal temperature of 160 degrees F (70 degrees C). 6. Mix the remaining tomato sauce and ketchup in a small bowl. Pour over the top of the meatloaf, and continue baking for 10 minutes. 7. Serve hot and enjoy!",
  "prep": "15 mins",
  "cook": "1 hr 10 mins",
  "total": "1 hr 25 mins",
  "calories": "213"
},
{
  "url": "https://www.allrecipes.com/recipe/16330/stuffed-peppers/",
  "name": "Stuffed Peppers",
  "rating": "4.4",
  "ratingcount": "2",
  "ingredients": "1 cup cold water; ½ cup uncooked long grain white rice; 1 tablespoon vegetable oil; 1 pound ground beef; 6 medium green bell peppers; 16 ounces tomato sauce, divided; 1 tablespoon Worcestershire sauce; ¼ teaspoon garlic powder; ¼ teaspoon onion powder; salt and ground black pepper to taste; 1 teaspoon Italian seasoning",
  "directions": "1. Gather all ingredients, and preheat the oven to 350 degrees F (175 degrees C). 2. Bring water and rice to a boil in a covered saucepan. Reduce heat to low and simmer until rice is tender, about 20 minutes. 3. Meanwhile, heat oil in a skillet over medium heat. Add ground beef and cook until evenly browned and crumbly, 7 to 9 minutes. 4. Hollow out bell peppers by removing and discarding the tops, seeds, and membranes. Slice the bottoms of the peppers if necessary to make sure they stand up straight. 5. Arrange peppers in a baking dish with the hollowed sides facing upward. 6. Prepare filling by mixing cooked beef, cooked rice, 1/2 of the tomato sauce, Worcestershire sauce, garlic powder, onion powder, salt, and pepper. Spoon an equal amount of filling into each hollowed pepper. 7. Mix remaining tomato sauce and Italian seasoning in a bowl, and pour over the stuffed peppers. 8. Bake in the preheated oven, basting with sauce every 15 minutes, until peppers are tender, about 1 hour. 9. Serve hot and enjoy!",
  "prep": "5 mins",
  "cook": "1 hr 25 mins",
  "total": "1 hr 30 mins",
  "calories": "248"
},
{
  "url": "https://www.allrecipes.com/recipe/58942/absolute-best-liver-and-onions/",
  "name": "Absolute Best Liver and Onions",
  "rating": "4.7",
  "ratingcount": "788",
  "ingredients": "2 pounds sliced beef liver; 1 ½ cups milk, or as needed; ¼ cup butter, divided; 2 large Vidalia onions, sliced into rings; 2 cups all-purpose flour, or as needed; salt and pepper to taste",
  "directions": "1. Gently rinse liver slices under cold water and pat dry with paper towels. Place in a shallow dish; pour in enough milk to cover. Let stand while preparing onions, or set aside for longer if you have time. Soaking will remove any bitterness. 2. Melt 2 tablespoons of butter in a large skillet over medium heat. Add onion rings; cook and stir in butter until tender and soft, about 3 to 5 minutes. Transfer onions into a bowl and set the skillet aside. 3. Place flour on a plate; season with salt and pepper. Drain milk from liver and coat liver slices in flour mixture. 4. Melt remaining 2 tablespoons of butter in the same skillet; increase heat to medium-high and fry coated liver slices until lightly browned, about 3 to 4 minutes on each side. Return onions to the skillet and reduce heat to medium; continue to cook until onions are heated through and liver is slightly pink inside, or longer to suit your taste.",
  "prep": "20 mins",
  "cook": "15 mins",
  "total": "35 mins",
  "calories": "687"
},
{
  "url": "https://www.allrecipes.com/recipe/220854/chef-johns-italian-meatballs/",
  "name": "Chef John's Italian Meatballs",
  "rating": "4.8",
  "ratingcount": "2",
  "ingredients": "⅓ cup plain bread crumbs; ½ cup milk; 2 tablespoons olive oil; 1  onion, diced; 1 pound ground beef; 1 pound ground pork; 2  eggs; 2 tablespoons grated Parmesan cheese; ¼ bunch fresh parsley, chopped; 3 cloves garlic, crushed; 2 teaspoons salt; 1 teaspoon ground black pepper; 1 teaspoon dried Italian herb seasoning; ½ teaspoon red pepper flakes",
  "directions": "1. Cover a baking sheet with foil and spray lightly with cooking spray. Soak bread crumbs in milk in a small bowl for 20 minutes. 2. Meanwhile, heat olive oil in a skillet over medium heat. Add onion; cook and stir until onion has softened and turned translucent, about 5 minutes. Reduce heat to low and continue cooking and stirring until onion is very tender, about 15 minutes more. 3. Gently stir beef and pork together in a large bowl. Add onions, bread crumb mixture, eggs, Parmesan cheese, parsley, garlic, salt, black pepper, Italian herb seasoning, and red pepper flakes; mix together using a rubber spatula until combined. Cover and refrigerate for about one hour. 4. Preheat the oven to 425 degrees F (220 degrees C). 5. Form mixture into balls about 1 1/2 inches in diameter; arrange in a single layer on the prepared baking sheet. 6. Bake in the preheated oven until browned and cooked through, 15 to 20 minutes.",
  "prep": "20 mins",
  "cook": "35 mins",
  "total": "2 hrs 15 mins",
  "calories": "390"
},
{
  "url": "https://www.allrecipes.com/recipe/24264/sloppy-joes-ii/",
  "name": "Sloppy Joes",
  "rating": "4.7",
  "ratingcount": "7",
  "ingredients": "1 pound lean ground beef; ¼ cup chopped onion; ¼ cup chopped green bell pepper; ¾ cup ketchup, or to taste; 1 tablespoon brown sugar, or to taste; 1 teaspoon yellow mustard, or to taste; ½ teaspoon garlic powder; salt and ground black pepper to taste; 6  hamburger buns, split",
  "directions": "1. Heat a large skillet over medium heat. Cook and stir lean ground beef in the hot skillet until some of the fat starts to render, 3 to 4 minutes. Add onion and bell pepper; continue to cook until vegetables have softened and beef is cooked through, 3 to 5 more minutes. 2. Stir in ketchup, brown sugar, mustard, and garlic powder; season with salt and pepper. Reduce heat to low and simmer for 20 to 30 minutes. 3. Divide meat mixture evenly among hamburger buns.",
  "prep": "5 mins",
  "cook": "30 mins",
  "total": "35 mins",
  "calories": "243"
},
{
  "url": "https://www.allrecipes.com/recipe/228823/quick-beef-stir-fry/",
  "name": "Quick Beef Stir-Fry",
  "rating": "4.4",
  "ratingcount": "422",
  "ingredients": "2 tablespoons vegetable oil; 1 pound beef sirloin, cut into 2-inch strips; 1 ½ cups fresh broccoli florets; 1  red bell pepper, cut into matchsticks; 2  carrots, thinly sliced; 1  green onion, chopped; 1 teaspoon minced garlic; 2 tablespoons soy sauce; 2 tablespoons sesame seeds, toasted",
  "directions": "1. Gather all ingredients. 2. Heat vegetable oil in a large wok or skillet over medium-high heat; cook and stir beef until browned, 3 to 4 minutes. 3. Move beef to the side of the wok and add broccoli, bell pepper, carrots, green onion, and garlic to the center of the wok. Cook and stir vegetables for 2 minutes. 4. Stir beef into vegetables and season with soy sauce and sesame seeds. Continue to cook and stir until vegetables are tender, about 2 more minutes. 5. Serve hot and enjoy!",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "268"
},
{
  "url": "https://www.allrecipes.com/recipe/16311/simple-beef-stroganoff/",
  "name": "Simple Beef Stroganoff",
  "rating": "4.3",
  "ratingcount": "893",
  "ingredients": "1 (8 ounce) package egg noodles; 1 pound ground beef; 1 (10.5 ounce) can fat-free condensed cream of mushroom soup; 1 tablespoon garlic powder, or to taste; ½ cup sour cream; salt and ground black pepper to taste",
  "directions": "1. Gather all ingredients. 2. Sauté ground beef in a large skillet over medium heat until browned and crumbly; 5 to 10 minutes. 3. Meanwhile, fill a large pot with lightly salted water and bring to a rapid boil. Cook egg noodles at a boil until tender yet firm to the bite, 7 to 9 minutes. Drain and set aside. 4. Drain and discard any fat from the cooked beef. Stir condensed soup and garlic powder into the beef. Simmer for 10 minutes, stirring occasionally. 5. Remove beef from the heat. Add egg noodles and stir to combine. Stir in sour cream and season with salt and pepper. 6. Serve hot and enjoy!",
  "prep": "5 mins",
  "cook": "15 mins",
  "total": "20 mins",
  "calories": "679"
},
{
  "url": "https://www.allrecipes.com/recipe/8539032/perfect-pan-seared-filet-mignon/",
  "name": "Perfect Pan Seared Filet Mignon",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "2 (8 ounce) filet mignon steaks; 2 teaspoons kosher salt; 1 teaspoon freshly ground black pepper; 2 tablespoons olive oil; 2 tablespoons butter or herb butter (optional); 2 tablespoons butter; 18 (8 ounce) packages sliced baby portobello mushrooms; ¼ cup white wine; 1 teaspoon Worcestershire sauce; ½ cup heavy cream; freshly cracked black pepper; 2 teaspoons freshly squeezed lemon juice",
  "directions": "1. Gather all ingredients. 2. Allow steaks to sit at room temperature 30 minutes before cooking. Meanwhile, preheat the oven to 425 degrees F (220 degrees C). 3. Heat oil in a large oven-proof skillet over high heat. Season one side of steaks liberally with salt and pepper in an even layer. Place filets seasoned side down into the skillet and cook, undisturbed until a rich golden brown crust has formed, about 3 minutes. Season the other side with salt and pepper and flip the steaks. Cook 2 minutes longer and then move the skillet to the preheated oven. 4. Cook in the preheated oven 2 to 3 minutes longer for rare, about 4 minutes for medium-rare, 5 to 7 minutes for medium, about 8 minutes for medium well and 1 to 2 more minutes for well done. 5. Remove steaks from the skillet. Add butter if desired and tent with foil. Allow steak to rest for 10 minutes before serving. 6. Meanwhile, return skillet to the stovetop over medium-high heat and melt 2 tablespoons butter in the drippings. Add mushrooms and cook, stirring often, until browned, about 5 minutes. Pour in wine to deglaze skillet and scrape the bottom with a wooden spoon to loosen any browned bits. 7. Cook until the liquid is mostly evaporated. Stir in cream, Worcestershire sauce, and pepper and bring mixture to a simmer, stirring often. Reduce heat to medium-low and cook until slightly thickened, about 2 minutes. Season with more salt if desired. Stir in lemon juice and serve mushroom sauce with filet mignon. 8. Serve and enjoy!",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "50 mins",
  "calories": "1624"
},
{
  "url": "https://www.allrecipes.com/recipe/78370/hamburger-steak-with-onions-and-gravy/",
  "name": "Hamburger Steak with Onions and Gravy",
  "rating": "4.6",
  "ratingcount": "4",
  "ingredients": "1 pound ground beef; ¼ cup bread crumbs; 1  egg; 1 teaspoon Worcestershire sauce; ½ teaspoon seasoned salt; ½ teaspoon onion powder; ½ teaspoon garlic powder; ⅛ teaspoon ground black pepper; 1 tablespoon vegetable oil; 1 cup thinly sliced onion; 2 tablespoons all-purpose flour; 1 cup beef broth; 1 tablespoon cooking sherry; ½ teaspoon seasoned salt",
  "directions": "1. Mix ground beef, bread crumbs, egg, Worcestershire sauce, salt, onion powder, garlic powder, and pepper together in a large bowl until combined. Form into 8 balls and flatten into patties. 2. Heat oil in a large skillet over medium heat. Add patties and onion; fry until patties are nicely browned, about 4 minutes per side. Transfer beef patties to a plate, and keep warm. 3. Sprinkle flour over onions and drippings in the skillet. Stir in flour with a fork, scraping bits of beef off of the bottom of the skillet as you stir. Gradually mix in beef broth and sherry. Season with seasoned salt. Simmer and stir over medium-low heat until gravy thickens, about 5 minutes. 4. Reduce heat to low, return patties to the gravy, cover, and simmer until cooked through, about 15 minutes.",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "40 mins",
  "calories": "319"
},
{
  "url": "https://www.allrecipes.com/recipe/139269/grilled-tri-tip/",
  "name": "Grilled Tri-Tip",
  "rating": "4.1",
  "ratingcount": "52",
  "ingredients": "4 pounds tri-tip roast; 4 cloves garlic, peeled and very thinly sliced; ⅓ cup salt; ⅓ cup black pepper; ⅓ cup garlic salt or to taste",
  "directions": "1. Using a sharp knife, cut small slits in the top of the roast; insert garlic slices into the slits. 2. Mix salt, pepper, and garlic salt together in a small bowl; rub all over the tri-tip and refrigerate for at least 1 hour or up to 1 day. Remove tri-tip from the refrigerator about 20 minutes before grilling. 3. Preheat an outdoor grill for high heat and lightly oil the grate. 4. Place the meat directly above the flame to sear the meat and lock in the juices, about 5 to 10 minutes per side. 5. Turn the grill down to medium heat and continue to cook, turning occasionally, for another 25 to 30 minutes. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C) for medium-rare. Let stand, covered loosely with aluminum foil, for 5 minutes before slicing.",
  "prep": "15 mins",
  "cook": "35 mins",
  "total": "1 hr 55 mins",
  "calories": "366"
},
{
  "url": "https://www.allrecipes.com/recipe/49404/juiciest-hamburgers-ever/",
  "name": "Juiciest Hamburgers Ever",
  "rating": "4.4",
  "ratingcount": "1",
  "ingredients": "2 pounds ground beef; 1  egg, beaten; ¾ cup dry bread crumbs; 3 tablespoons evaporated milk; 2 tablespoons Worcestershire sauce; ⅛ teaspoon cayenne pepper; 2 cloves garlic, minced",
  "directions": "1. Gather all ingredients. 2. Preheat a grill for high heat. 3. Mix the ground beef, egg, bread crumbs, evaporated milk, Worcestershire sauce, cayenne pepper, and garlic in a large bowl using your hands. 4. Form the mixture into 8 hamburger patties. 5. Lightly oil the grill grate. Grill patties until browned and no longer pink, about 5 minutes per side. 6. Serve hot and enjoy!",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "35 mins",
  "calories": "288"
},
{
  "url": "https://www.allrecipes.com/recipe/246418/traditional-irish-stew/",
  "name": "Slow Cooker Irish Stew",
  "rating": "3.8",
  "ratingcount": "5",
  "ingredients": "3  russet potatoes, diced; 1 pound baby carrots; 1 large onion, chopped; 4 cloves garlic, minced; 1 tablespoon olive oil, or to taste; 2 pounds beef chuck roast, cubed; 1 (16 ounce) bottle stout beer, divided; 1 (6 ounce) can tomato paste; 1 cup beef broth; 1 tablespoon garlic powder; 1 tablespoon onion powder; 1 tablespoon smoked paprika; salt and ground black pepper to taste",
  "directions": "1. Place potatoes, carrots, onion, and garlic into a slow cooker. 2. Heat olive oil in a skillet over medium heat. Add beef; cook and stir until evenly browned, about 10 minutes. Transfer beef to the slow cooker with vegetables. 3. Pour 1/4 cup beer into the same skillet and bring to a boil while scraping the browned bits of beef off of the bottom of the skillet with a wooden spoon. Stir in tomato paste; cook until thickened, about 5 minutes. Pour mixture into the slow cooker. 4. Pour remaining beer, beef broth, garlic powder, onion powder, paprika, salt, and pepper into the slow cooker. 5. Cook on Low until potatoes and carrots are easily pierced with a fork, about 8 hours, or on High for 3 to 4 hours.",
  "prep": "15 mins",
  "cook": "3 hrs 15 mins",
  "total": "3 hrs 30 mins",
  "calories": "334"
},
{
  "url": "https://www.allrecipes.com/recipe/231026/keema-aloo-ground-beef-and-potatoes/",
  "name": "Keema Aloo (Ground Beef and Potatoes)",
  "rating": "4.6",
  "ratingcount": "322",
  "ingredients": "2 tablespoons extra-virgin olive oil; 1 extra-large onion, chopped; 2 tablespoons water (Optional); 2 pounds lean ground beef; 4 cloves garlic, minced; 2 tablespoons grated fresh ginger root; 1  serrano chile pepper, finely chopped; 2 teaspoons chopped fresh cilantro; 1 tablespoon ground coriander; 1 ½ teaspoons salt; 1 ½ teaspoons ground cumin; 1 teaspoon ground cayenne pepper; 1 teaspoon ground turmeric; 3  potatoes, peeled and diced; 1 (28 ounce) can diced tomatoes; 1 cup frozen green peas; 1 teaspoon garam masala",
  "directions": "1. Heat olive oil in a large saucepan over medium-high heat. Add onion; cook and stir until soft and beginning to brown, about 12 minutes. If browned bits of onion are stuck to the bottom of the pan, add water and stir to loosen. 2. Stir ground beef, garlic, ginger, serrano chile, and cilantro into the pan; cook and stir until beef is browned and crumbly, 10 to 15 minutes. Reduce heat to medium-low. Stir in coriander, salt, cumin, cayenne pepper, and turmeric; cook and stir until flavors blend, about 5 minutes. Add potatoes and tomatoes; cover and simmer until potatoes are tender, about 15 minutes. 3. Stir in green peas and cook until sauce has slightly thickened and flavors have blended, 10 to 15 minutes. Sprinkle garam masala over top, cover, and let stand for 5 minutes before serving.",
  "prep": "20 mins",
  "cook": "55 mins",
  "total": "1 hr 20 mins",
  "calories": "362"
},
{
  "url": "https://www.allrecipes.com/recipe/83646/corned-beef-roast/",
  "name": "Corned Beef Roast",
  "rating": "4.4",
  "ratingcount": "68",
  "ingredients": "1 (5 1/2 pound) corned beef brisket with spice packet; 7 small potatoes, peeled and diced; 4 medium carrots, peeled and diced; 1 medium onion, diced; 3 cloves garlic, chopped",
  "directions": "1. Preheat the oven to 300 degrees F (150 degrees C). 2. Place corned beef brisket in the center of a roasting pan. Arrange potatoes and carrots around the sides, then scatter onion and garlic over top. Sprinkle seasoning packet over beef, then pour in water until potatoes are almost covered. Cover with a lid or heavy aluminum foil. 3. Roast in the preheated oven until corned beef is so tender it can be flaked apart with a fork, about 5 to 6 hours.",
  "prep": "15 mins",
  "cook": "5 hrs",
  "total": "5 hrs 15 mins",
  "calories": "465"
},
{
  "url": "https://www.allrecipes.com/recipe/8526329/sous-vide-tri-tip/",
  "name": "Sous Vide Tri Tip",
  "rating": "3.0",
  "ratingcount": "2",
  "ingredients": "1 (2 1/2 to 3 pound) tri tip steak, fat cap trimmed to 1/4-inch thick; 1 teaspoon toasted sesame oil; 1 tablespoon kosher salt, divided; 2 tablespoons unsalted butter, cut into 1/2-inch cubes; 1 tablespoon coriander seeds, coarsely ground; 1 tablespoon black peppercorns, coarsely ground; 2 tablespoons grapeseed oil; ½ cup fresh lime juice (from 3 large limes); ½ cup fish sauce; ¼ cup dark brown sugar; 4 medium garlic cloves, grated with a Microplane grater (about 2 tsp.); 1 (1 inch) piece fresh ginger, peeled and grated with a Microplane grater (about 1 1/2 tsp.); 2 medium green onions, white bottoms finely chopped and green tops thinly sliced crosswise (about 2 Tbsp. minced white bottoms, about 1/4 cup thinly sliced green tops); 1 tablespoon toasted sesame seeds; ½ teaspoon toasted sesame oil",
  "directions": "1. Prepare a thermocirculator and water bath according to manufacturer's directions. Set thermocirculator to 135 degrees F (57 degrees C) and allow water bath to come up to temperature. 2. Using gloved hands, rub tri tip steak evenly with sesame oil and season evenly with 1 teaspoon salt. Transfer tri tip and butter to a large vacuum-sealable bag and arrange in a flat, even layer. Seal bag with a vacuum sealer according to manufacturer's directions. 3. Transfer vacuum-sealed tri tip to warm water bath with thermocirculator, cover vessel with aluminum foil to reduce evaporation, and cook 3 hours. Remove tri tip from bag (meat will be at 135 degrees F (57 degrees C) when pulled from water bath) and transfer to a rimmed sheet pan lined with paper towels and gently pat dry; discard bag and any juices reserved in bag. 4. Meanwhile prepare the chile-lime dipping sauce. Whisk together lime juice, fish sauce, brown sugar, garlic, ginger, green onions, sesame seeds, and toasted sesame oil in a small bowl until well combined. Cover dipping sauce with plastic wrap and set aside at room temperature until ready to use. 5. Season tri tip evenly with remaining 2 teaspoons salt, coriander seeds, and black peppercorns, pressing coriander and black peppercorns into tri tip to adhere. 6. Heat grapeseed oil in a large cast iron skillet over medium-high heat. Add tri tip to skillet, fat-cap-side down, and cook, until all sides are evenly seared and caramelized, 3 to 5 minutes per side. 7. Transfer tri tip to a large cutting board and let rest for 5 minutes before slicing against the grain into 1/4-inch-thick strips. 8. Serve steak with chile-lime dipping sauce for dipping, if desired.",
  "prep": "",
  "cook": "",
  "total": "3 hrs 15 mins",
  "calories": "226"
},
{
  "url": "https://www.allrecipes.com/recipe/8465373/slow-cooker-beef-massaman-curry/",
  "name": "Slow Cooker Beef Massaman Curry",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "3 pounds boneless beef chuck roast; 3 ½ tablespoons cornstarch, divided; ½ teaspoon kosher salt; ½ teaspoon ground black pepper; 2 tablespoons canola oil; 6 tablespoons Massaman curry paste; 1 cup low-sodium beef broth; 1 (13.5 ounce) can unsweetened coconut cream; 1 pound baby Yukon Gold potatoes; 2 tablespoons cold water; 1  lime, zested and juiced; 3 cups cooked jasmine rice; ½ cup roasted cashews; 1 cup chopped fresh cilantro leaves and stems; 1 medium Fresno chile, thinly sliced; additional lime wedges, for serving, if desired",
  "directions": "1. Pat beef dry with paper towels, trim, and cut into 1 1/2- to 2-inch pieces. Place in a bowl with 2 tablespoons cornstarch, salt, and pepper; toss to coat beef evenly. 2. Heat oil in a large nonstick skillet over medium-high heat. Add half of the beef and cook, turning often, until beef is browned on all sides, about 6 minutes (do not overcrowd the skillet to ensure browning). Repeat process with remaining beef, using any residual oil in the skillet. (Do not wipe skillet clean.) Place browned beef in an ungreased 6-quart slow cooker. 3. Once all beef has been browned, lower heat to medium and add curry paste, stirring to release any browned bits from the skillet. Add beef broth and coconut cream to skillet, stirring to combine ingredients. Pour mixture over beef in slow cooker. Add potatoes to slow cooker; cover and cook on HIGH for 4 hours, or LOW for 6 hours, or until beef is very tender when pierced with a fork. 4. Remove beef and potatoes to a large bowl, and carefully pour liquid from slow cooker into a heatproof glass measuring cup or bowl and allow to stand until fat settles on top of liquid, about 2 minutes. Remove fat from the surface of the liquid with a ladle and discard. 5. Pour remaining liquid into a saucepan and bring to a boil, undisturbed, over medium-high heat. Whisk remaining 1 1/2 tablespoons cornstarch with 2 tablespoons cold water together in a small bowl; add to boiling liquid in saucepan, whisking until mixture thickens, 2 to 5 minutes. Return meat and potatoes to thickened sauce; stir in lime zest and juice. 6. Serve family-style, or place 1/2 cup rice into each of 6 bowls, spoon 1 1/3 cups beef, potatoes, and sauce mixture over rice, and garnish each portion with cashews, cilantro, sliced chile, and a lime wedge.",
  "prep": "10 mins",
  "cook": "4 hrs 30 mins",
  "total": "4 hrs 42 mins",
  "calories": "832"
},
{
  "url": "https://www.allrecipes.com/recipe/8526807/ground-beef-stroganoff-noodles/",
  "name": "Ground Beef Stroganoff Noodles",
  "rating": "4.8",
  "ratingcount": "42",
  "ingredients": "1 tablespoon unsalted butter; 1 tablespoon vegetable oil; 1 cup thinly sliced mushrooms; 1 teaspoon salt, plus more to taste; ½ cup diced onion; 1 pound ground beef; freshly ground black pepper; 1 pinch cayenne pepper; 2 cloves minced garlic; 1 ⅓ tablespoons flour; 2 tablespoons vodka (Optional); 2 ½ cups beef broth, or as needed; 1 cup water; 2 ½ cups egg noodles; ½ cup sour cream, plus more for serving; 2 tablespoons fresh sliced chives or green onions",
  "directions": "1. Gather all ingredients. 2. Melt butter and oil in a skillet over medium-high heat. Add mushrooms, season with salt, and saute, stirring occasionally, until they turn golden brown, 5 to 10 minutes. 3. Add onion and ground beef. Cook, stirring, until meat is browned and crumbly, and onions turn soft and translucent, about 5 minutes. Season with black pepper and cayenne. 4. Stir in minced garlic and flour, and cook for 1 minute. 5. Pour in vodka and allow to evaporate, about 30 seconds. 6. Stir in beef broth and water and bring to a simmer. Cook, stirring occasionally, for 10 minutes. 7. Reduce heat to medium, and mix in noodles. Cover with a tight-fitting lid and simmer for 5 minutes. Uncover and stir thoroughly. Cover again and cook until noodles are just tender, about 3 minutes. (See Cook's Note.) 8. Once noodles are cooked, reduce heat to low, and stir in sour cream. 9. Serve immediately with additional sour cream and green onions or chives if so desired.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "40 mins",
  "calories": "598"
},
{
  "url": "https://www.allrecipes.com/recipe/8444531/john-wayne-casserole/",
  "name": "John Wayne Casserole",
  "rating": "4.6",
  "ratingcount": "46",
  "ingredients": "1 (16.3 ounce) can refrigerated biscuits; 2 pounds ground beef; 1 (1 ounce) package taco seasoning; ¾ cup water; 1 medium onion, halved and sliced; 1 medium red bell pepper, halved and sliced (1 1/2 cups); ½ cup sour cream; ½ cup mayonnaise; 8 ounces shredded Cheddar cheese, divided; 2 medium tomatoes, sliced; 1 (4 ounce) jar sliced jalapeno peppers, drained (Optional)",
  "directions": "1. Gather the ingredients. Preheat the oven to 350 degrees F (175 degrees C) and lightly grease a 9x13-inch baking pan. 2. Place and press biscuit dough into the bottom of the baking pan and halfway up the sides. 3. Bake in the preheated oven until lightly browned, 15 to 20 minutes. Leave the oven on. 4. Meanwhile, heat a nonstick skillet over medium-high heat and cook ground beef until browned and crumbly, about 5 minutes. Drain fat. Stir in taco seasoning and water. Bring to a boil, reduce heat, and simmer, stirring occasionally, for 5 minutes. Transfer cooked meat to a bowl and wipe out the skillet. 5. Add onion and bell peppers to the same skillet and cook over medium heat until slightly tender, about 5 minutes. 6. Combine sour cream, mayonnaise, 1/2 of the Cheddar cheese, and 1/2 of the onion-pepper mixture in a bowl. 7. Layer browned meat, tomatoes, onion-pepper mixture, jalapeño peppers, and sour cream mixture on top of prebaked biscuit dough. Sprinkle with remaining Cheddar cheese. 8. Bake uncovered in the preheated oven until cheese is lightly browned and bubbly, 30 to 40 minutes.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr",
  "calories": "538"
},
{
  "url": "https://www.allrecipes.com/recipe/8472764/pan-fried-cube-steaks-with-simple-pan-sauce/",
  "name": "Pan-Fried Cube Steaks with Simple Pan Sauce",
  "rating": "5.0",
  "ratingcount": "3",
  "ingredients": "24 ounces cube steak, cut into 4 portions; 3 tablespoons unsalted butter, divided; salt and freshly ground black pepper to taste; ⅓ cup Worcestershire sauce, divided; ½ cup water",
  "directions": "1. Lightly season both sides of each cube steak with salt and pepper. (See Cook's Note). 2. Melt 1 Tablespoon unsalted butter in a large, non-stick skillet over medium heat. Once butter is foamy, add cube steaks and sprinkle about 2 teaspoons Worcestershire sauce on top of each cube steak. Cook until brown, 3 to 4 minutes. 3. Turn the steaks, and sprinkle each with an additional 1 to 2 teaspoons Worcestershire sauce. Cook until steaks are firm and reddish-pink and juicy in the center, about 3 minutes more. An instant-read thermometer inserted into the center should read 135 degrees F (57 degrees C). Remove to a platter and tent with foil. 4. To make the pan sauce, pour about 1/2 cup water into the skillet and stir all the browned bits from the bottom of the pan. Bring to a boil and cook for about 2 minutes. 5. Remove from heat and stir in remaining butter, until melted. 6. Evenly divide pan sauce over each cube steak and serve warm.",
  "prep": "5 mins",
  "cook": "10 mins",
  "total": "15 mins",
  "calories": "393"
},
{
  "url": "https://www.allrecipes.com/recipe/8524756/sous-vide-beef-brisket-with-ancho-chili-sauce/",
  "name": "Sous Vide Beef Brisket with Ancho Chili Sauce",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "1 (6 pound) beef brisket; 2 tablespoons kosher salt; 2 teaspoons onion powder; 2 teaspoons garlic powder; 1 teaspoon smoked paprika; 1 teaspoon ground black pepper; 2 ounces dried ancho chiles (about 4 medium dried chiles); ¼ cup canola oil, divided; 2 cups chopped red onion; 4 medium garlic cloves, peeled and smashed; 2 tablespoons tomato paste; ¾ cup dry red wine; ½ cup ketchup; ¼ cup melted unsalted butter; 1 tablespoon sherry vinegar; ½ teaspoon cayenne pepper or hot sauce, as desired (Optional)",
  "directions": "1. Prepare a thermocirculator and water bath according to manufacturer's directions. Set thermocirculator to 128 degrees F (53 degrees C) and allow water bath to come up to temperature. 2. While water heats, trim excess fat from the fat cap of the brisket to about 1/4 inch. Do not remove all the fat, as this will contribute to keeping the meat juicy. Pat brisket dry with a paper towel. 3. Combine salt, onion powder, garlic powder, smoked paprika and pepper in a small bowl. Completely cover all sides of the brisket with the spice mixture. 4. Place the brisket in a large vacuum sealable bag. Seal bag according to manufacturer's directions. Transfer vacuum sealed brisket to warm water bath with thermocirculator, cover vessel with aluminum foil to reduce evaporation, and cook undisturbed for 48 hours. Remove brisket from bag, reserving cooking liquid (you should have about 3 ½ cups cooking liquid). Strain cooking liquid through a fine mesh sieve and discard any solids. Set brisket aside on a plate or cutting board. 5. Place dried ancho chiles in a large, dry saucepan over medium high heat. Cook, turning often, until chiles are blistered, and aromatic. Remove chiles from heat and allow to cool briefly. Once chiles have cooled enough to handle, remove stems and seeds, and tear chiles into 2-inch pieces. Place torn chiles in a medium bowl with 1 cup of boiling water and 2 cups of strained, reserved cooking liquid; allow to stand until chiles have softened, about 10 minutes. 6. Meanwhile, heat 2 tablespoons canola oil in the same saucepan over medium-high heat. Add onions and smashed garlic cloves; cook, stirring often, until onions and garlic have softened, about 5 minutes. Add tomato paste and cook, stirring often, for 1 minute. Add red wine and allow mixture to reduce until most of the liquid excep tfor about 1/4 cup has evaporated, stirring occasionally. Remove from heat. 7. Remove softened chiles from liquid, and strain liquid through a fine mesh sieve, reserving 1/2 cup of the strained liquid. Combine softened chiles, 1/2 cup reserved liquid, onion mixture, and ketchup in a blender; blend until smooth. Add unsalted butter and sherry vinegar to the mixture and process until smooth. If you want a spicier sauce, add cayenne pepper or hot sauce to taste. 8. Preheat a grill or grill pan to medium high (350 degrees F to 400 degrees F / 175 degrees C to 200 degrees C). 9. Pat brisket dry with paper towels and rub with remaining 2 tablespoons oil. Place on the preheated grill and grill until grill marks appear, the outside is slightly charred, and the brisket is heated through, about 5 minutes per side. 10. Transfer brisket to a cutting board, let stand for 5 minutes to rest, and slice thinly against the grain of the meat and serve hot with sauce.",
  "prep": "30 mins",
  "cook": "2 days",
  "total": "2 days 55 mins",
  "calories": "1239"
},
{
  "url": "https://www.allrecipes.com/recipe/8489146/homemade-smash-burgers/",
  "name": "Homemade Smash Burgers",
  "rating": "5.0",
  "ratingcount": "13",
  "ingredients": "4  hamburger buns; 2 tablespoons butter, softened, or as needed; 1 pound ground chuck beef (80% lean); 4 6-inch squares parchment paper; salt to taste; 4 slices American cheese; burger toppings of choice",
  "directions": "1. Preheat an outdoor grill for high heat and lightly oil the grate. Set a cast iron flat-top griddle or large cast iron skillet onto the grill and preheat until smoking. 2. Spread butter on the inside of the buns and toast on the flat-top until lightly browned. Set aside. 3. Form meat into 8 loosely-packed balls, 2 ounces each. Do not pack the meat tightly, as this will prevent it from smashing properly. Place each ball on the hot flat-top, cover with a piece of parchment (to prevent sticking to the spatula; re-use each parchment square on a second patty) and immediately smash down to a 1/4 inch thickness using 2 stiff, sturdy spatulas that are criss-crossed to get proper leverage as you press down. You may also use the bottom of small skillet. Sprinkle the meat with salt. 4. Grill for about 45 seconds, until the edges are dark brown and the centers are a light pink color. Using a bench scraper or firm spatula, gently scrape up the patties, flip over and immediately cover 4 of them with cheese. Grill an additional 15 to 20 seconds; stack the plain patties over the cheese-covered patties so you have 4 stacks. Move each stack to a bun and serve with your favorite toppings.",
  "prep": "15 mins",
  "cook": "5 mins",
  "total": "20 mins",
  "calories": "632"
},
{
  "url": "https://www.allrecipes.com/recipe/215231/empanadas-beef-turnovers/",
  "name": "Empanadas (Beef Turnovers)",
  "rating": "4.8",
  "ratingcount": "156",
  "ingredients": "1 tablespoon Goya Extra Virgin Olive Oil; ½ pound ground beef; ½ medium yellow onion, finely chopped; ¼ cup Goya Tomato Sauce; 6  Goya Spanish Olives Stuffed with Minced Pimientos, thinly sliced; 2 tablespoons Goya Sofrito; 1 packet Sazon Goya with Coriander and Annatto; 1 teaspoon Goya Minced Garlic; ½ teaspoon Goya Dried Oregano; Goya Ground Black Pepper, to taste; 1 (14 ounce) package yellow or white Goya Discos empanada discs, thawed; 1 quart Goya Corn Oil, for frying",
  "directions": "1. Heat olive oil in a large skillet over medium heat. Add ground beef; cook and stir until browned and crumbly, about 10 minutes. Add onions and cook until soft, about 5 minutes. Stir in tomato sauce, olives, sofrito, sazón, garlic, oregano, and pepper. Reduce the heat to medium-low and simmer until mixture thickens, about 15 minutes. 2. Roll empanada disks on a lightly floured surface until 1/2 inch larger in diameter. Spoon about 1 tablespoon meat mixture into the middle of each disk. Moisten the disk edges with water, fold in half over filling to form a half-moon, and pinch to seal (or seal with a fork). 3. Heat 2 1/2 inches corn oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C). Working in batches, fry empanadas until crisp and golden brown, flipping once, 4 to 6 minutes. Transfer to paper towels to drain.",
  "prep": "45 mins",
  "cook": "50 mins",
  "total": "1 hr 35 mins",
  "calories": ""
},
{
  "url": "https://www.allrecipes.com/recipe/8486795/crispy-garlic-crumb-steak/",
  "name": "Crispy Garlic Crumb Steak",
  "rating": "4.5",
  "ratingcount": "4",
  "ingredients": "½ cup panko bread crumbs; 5 tablespoons olive oil, divided; 2 cloves garlic, crushed; 1 pound top-sirloin steak, trimmed; salt and freshly ground black pepper to taste",
  "directions": "1. Gather all ingredients. 2. Put breadcrumbs in a small bowl. 3. Combine 3 tablespoons olive oil and garlic in a skillet and heat over medium heat until garlic sizzles, 20 to 30 seconds. 4. Strain olive oil into the breadcrumbs and mix to combine to create garlic crumbs. Allow garlic crumbs to cool. 5. Cut the steak into two (8-pounce) portions. Place one of the steaks onto a piece of plastic wrap and fold wrap over to cover meat. Pound with a tenderizer or another heavy object to 1/4 inch thickness. Repeat with the second steak. 6. Season on both sides with salt and pepper. 7. Spoon cooled garlic crumb over the flattened steak to cover the surface up to the edges. 8. Fold over plastic wrap and pound again to drive garlicky breadcrumbs into the steak. Flip steak over and repeat process on the other side. 9. Heat remaining 2 tablespoon olive oil in a skillet over medium-high heat. Once hot, add steak and cook until meat starts to sizzle, 1 to 2 minutes. Reduce heat to medium and cook about 2 minutes per side for medium to medium-rare. An instant-read thermometer inserted into the center should read 130 to140 degrees F (54 to 60 degrees C). 10. Serve and enjoy!",
  "prep": "10 mins",
  "cook": "5 mins",
  "total": "15 mins",
  "calories": "666"
},
{
  "url": "https://www.allrecipes.com/recipe/158140/spaghetti-sauce-with-ground-beef/",
  "name": "Homemade Spaghetti Sauce with Ground Beef",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "1 pound ground beef; 1 medium onion, chopped; 4 cloves garlic, minced; 1 small green bell pepper, diced; 1 (28 ounce) can diced tomatoes; 1 (16 ounce) can tomato sauce; 1 (6 ounce) can tomato paste; 2 teaspoons dried oregano; 2 teaspoons dried basil; 1 teaspoon salt; ½ teaspoon ground black pepper",
  "directions": "1. Gather all ingredients. 2. Combine ground beef, onion, garlic, and green pepper in a large saucepan over medium-high heat. Cook and stir until meat is browned and crumbly and vegetables are tender, 5 to 7 minutes. Drain grease. 3. Stir diced tomatoes, tomato sauce, and tomato paste into the pan. Season with oregano, basil, salt, and pepper. Simmer spaghetti sauce for 1 hour, stirring occasionally. 4. Serve hot and enjoy!",
  "prep": "10 mins",
  "cook": "1 hr 5 mins",
  "total": "1 hr 15 mins",
  "calories": "185"
},
{
  "url": "https://www.allrecipes.com/recipe/16354/easy-meatloaf/",
  "name": "Easy Meatloaf",
  "rating": "4.6",
  "ratingcount": "9",
  "ingredients": "1 ½ pounds ground beef; 1  egg; 1  onion, chopped; 1 cup milk; 1 cup dried bread crumbs; salt and pepper to taste; ⅓ cup ketchup; 2 tablespoons brown sugar; 2 tablespoons prepared mustard",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a 9x5-inch loaf pan. 2. Combine ground beef, onion, milk, bread crumbs and egg in a large bowl; season with salt and pepper. Transfer into prepared loaf pan. 3. Mix ketchup, brown sugar, and mustard together in a small bowl until well combined; pour over meatloaf and spread it evenly over the top. 4. Bake in the preheated oven until no longer pink in the center, about 1 hour.",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "1 hr 15 mins",
  "calories": "372"
},
{
  "url": "https://www.allrecipes.com/recipe/8470679/korean-barbecue-style-meatballs/",
  "name": "Korean Barbecue-Style Meatballs",
  "rating": "4.7",
  "ratingcount": "24",
  "ingredients": "1 pound ground beef; 2 teaspoons gochujang (Korean hot pepper paste); 1 teaspoon kosher salt; 1 teaspoon freshly ground black pepper; 1 tablespoon soy sauce; 2 teaspoons grated fresh ginger (heated to 150 F degrees (65 degrees C) to deactivate enzymes, or soaked in 1 tablespoon vinegar for 5 minutes); 4 cloves garlic, finely minced; ⅓ cup thinly sliced green onions, plus more for garnish; ½ cup finely crushed buttery round crackers (such as Ritz®); toasted sesame seeds for garnish; 4 cloves garlic, minced; 2 tablespoons rice wine vinegar; ¾ cup beef broth or water; ⅓ cup brown sugar; ⅓ cup soy sauce; 1 tablespoon gochujang (Korean hot pepper paste); 1 teaspoon sesame oil; 1 teaspoon Sriracha hot sauce; 2 teaspoons cornstarch; 1 tablespoon water",
  "directions": "1. Add ground beef to a bowl and spread gochujang evenly over the surface of the meat. Season evenly with kosher salt, pepper, and soy sauce. Spreading out the seasoning will reduce the time you need to handle the meat. Spread fresh ginger and garlic evenly over the surface. Add green onions and cracker crumbs. Mix in quickly with a fork until well combined. 2. Cover and refrigerate for about 30 minutes. 3. Preheat the oven to 450 degrees C (220 degrees C). 4. Form mixture into 12 equal-sized balls using wet hands. Add to a cast iron skillet. 5. Bake meatballs in the preheated oven until nicely browned, about 20 minutes. 6. Transfer meatballs to a plate while preparing the sauce in the same skillet. 7. Drain most of the grease but 1 teaspoon out of the skillet and set onto stove over medium-high heat. Add garlic and stir until fragrant, about 1 minute. Deglaze skillet with rice vinegar and soy sauce. Stir in brown sugar, beef broth, and gochujang. Season with sesame oil and Sriracha. Stir sauce and bring to a simmer. Cook until reduced by a third. 8. Meanwhile stir together cornstarch and water in a small bowl to create a slurry. Reduce heat to medium-low and mix in slurry while whisking constantly. Keep simmering sauce until it has reduced to about half. Add meatballs back into the skillet and baste with the sauce. Allow to simmer, basting generously, until meatballs are heated through and are well soaked with sauce, 3 to 5 minutes. 9. Serve garnished with toasted sesame seeds and green onions.",
  "prep": "20 mins",
  "cook": "30 mins",
  "total": "1 hr 20 mins",
  "calories": "558"
},
{
  "url": "https://www.allrecipes.com/recipe/14685/slow-cooker-beef-stew-i/",
  "name": "Slow Cooker Beef Stew",
  "rating": "4.5",
  "ratingcount": "5",
  "ingredients": "2 pounds beef stew meat, cut into 1-inch pieces; ¼ cup all-purpose flour; ½ teaspoon salt; ½ teaspoon ground black pepper; 1 ½ cups beef broth; 4 medium carrots, sliced; 3 medium potatoes, diced; 1 medium onion, chopped; 1 stalk celery, chopped; 1 teaspoon Worcestershire sauce; 1 teaspoon ground paprika; 1 clove garlic, minced; 1 large bay leaf",
  "directions": "1. Gather ingredients. 2. Place meat in slow cooker. 3. Mix flour, salt, and pepper together in a small bowl. Pour over meat, and stir until meat is coated. 4. Add beef broth, carrots, potatoes, onion, celery, Worcestershire sauce, paprika, garlic, and bay leave; stir to combine. 5. Cover, and cook until beef is tender enough to cut with a spoon, on Low for 8 to 12 hours, or on High for 4 to 6 hours. 6. Serve hot and enjoy!",
  "prep": "20 mins",
  "cook": "4 hrs",
  "total": "4 hrs 20 mins",
  "calories": "576"
},
{
  "url": "https://www.allrecipes.com/recipe/8465557/beef-ragu/",
  "name": "Beef Ragu",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "2 tablespoons olive oil; 1 (2 pound) boneless beef chuck roast, cut into 2-inch cubes; 1 teaspoon ground black pepper; 3 teaspoons kosher salt, divided; 1  yellow onion, chopped; 6 cloves garlic, chopped; 2 tablespoons harissa (Optional); 2 tablespoons tomato paste; 1 cup dry red wine; 1 (28 ounce) can crushed tomatoes; 1  bay leaf; 1 pound pappardelle pasta, cooked and drained; grated Parmesan cheese, for serving",
  "directions": "1. Heat oil in a large Dutch oven over medium-high. Season chuck roast with pepper and 2 teaspoons salt. Sear meat until browned on every side, working in batches if necessary, about 10 minutes. Remove from Dutch oven and transfer to a large plate. 2. Reduce heat to medium and stir in onion. Cook, stirring often, until softened, about 8 minutes. Add garlic and cook, stirring constantly, until fragrant, about 1 minute. Stir in harissa and tomato paste; cook, stirring constantly, until caramelized, about 2 minutes. 3. Pour in wine and cook, scraping the bottom of the pot with a wooden spoon to loosen any browned bits, until reduced by two thirds, about 5 minutes. Stir in tomatoes, bay leaf, chuck roast, and remaining 1 teaspoon salt. Reduce heat to medium-low and cover. Cook, stirring occasionally, until meat is tender, sauce has thickened, and flavors meld, about 2 1/2 hours. 4. Remove and discard bay leaf. Transfer meat from Dutch oven to a cutting board and shred using 2 forks. Return meat to pot and stir in pappardelle. Top with grated Parmesan cheese.",
  "prep": "20 mins",
  "cook": "3 hrs",
  "total": "3 hrs 20 mins",
  "calories": "935"
},
{
  "url": "https://www.allrecipes.com/recipe/23600/worlds-best-lasagna/",
  "name": "World's Best Lasagna",
  "rating": "4.8",
  "ratingcount": "20",
  "ingredients": "1 pound sweet Italian sausage; ¾ pound lean ground beef; ½ cup minced onion; 2 cloves garlic, crushed; 1 (28 ounce) can crushed tomatoes; 2 (6.5 ounce) cans canned tomato sauce; 2 (6 ounce) cans tomato paste; ½ cup water; 2 tablespoons white sugar; 4 tablespoons chopped fresh parsley, divided; 1 ½ teaspoons dried basil leaves; 1 ½ teaspoons salt, divided, or to taste; 1 teaspoon Italian seasoning; ½ teaspoon fennel seeds; ¼ teaspoon ground black pepper; 12  lasagna noodles; 16 ounces ricotta cheese; 1  egg; ¾ pound mozzarella cheese, sliced; ¾ cup grated Parmesan cheese",
  "directions": "1. Gather all your ingredients. 2. Cook sausage, ground beef, onion, and garlic in a Dutch oven over medium heat until well browned. 3. Stir in crushed tomatoes, tomato sauce, tomato paste, and water. Season with sugar, 2 tablespoons parsley, basil, 1 teaspoon salt, Italian seasoning, fennel seeds, and pepper. Simmer, covered, for about 1 1/2 hours, stirring occasionally. 4. Bring a large pot of lightly salted water to a boil. Cook lasagna noodles in boiling water for 8 to 10 minutes. Drain noodles, and rinse with cold water. 5. In a mixing bowl, combine ricotta cheese with egg, remaining 2 tablespoons parsley, and 1/2 teaspoon salt. 6. Preheat the oven to 375 degrees F (190 degrees C). 7. To assemble, spread 1 1/2 cups of meat sauce in the bottom of a 9x13-inch baking dish. Arrange 6 noodles lengthwise over meat sauce. Spread with 1/2 of the ricotta cheese mixture. Top with 1/3 of the mozzarella cheese slices. Spoon 1 1/2 cups meat sauce over mozzarella, and sprinkle with 1/4 cup Parmesan cheese. 8. Repeat layers, and top with remaining mozzarella and Parmesan cheese. Cover with foil: to prevent sticking, either spray foil with cooking spray or make sure the foil does not touch the cheese. 9. Bake in the preheated oven for 25 minutes. Remove the foil and bake for an additional 25 minutes. 10. Rest lasagna for 15 minutes before serving.",
  "prep": "30 mins",
  "cook": "2 hrs 30 mins",
  "total": "3 hrs 15 mins",
  "calories": "448"
},
{
  "url": "https://www.allrecipes.com/recipe/8491621/manti-armenian-dumplings/",
  "name": "Manti (Armenian Dumplings)",
  "rating": "5.0",
  "ratingcount": "3",
  "ingredients": "1 ⅔ cups all-purpose flour, or more as needed; 1 large egg; 1 ½ teaspoons olive oil; ½ teaspoon kosher salt; 2 tablespoons water, or as needed; ½ pound ground beef; ¼ cup finely diced onion; 2 tablespoons minced fresh parsley; 1 teaspoon smoked paprika; 1 teaspoon kosher salt; ½ teaspoon freshly ground black pepper; 1 pinch cayenne pepper; 1 tablespoon olive oil; 1 clove crushed garlic; ½ cup tomato sauce; 2 cups chicken or beef broth; salt and freshly ground black pepper to taste; cayenne pepper to taste",
  "directions": "1. Combine 3/4 of the flour, egg, olive oil, salt, and water in a bowl. Mix with a fork, just like when making a pasta dough, until ingredients just come together. Continue mixing everything with your hands into a shaggy dough. Turn out mixture onto a floured surface and keep kneading until dough is nice and smooth. Add additional flour as needed. Cover and allow dough to rest on the counter for 30 minutes. 2. Combine ground beef, onion, parsley, smoked paprika, kosher salt, pepper, and Armenian cayenne in a bowl. Mix with a fork at first, then use your hands until filling is well combined. Cover and chill in the refrigerator. 3. Preheat the oven to 400 degrees C (200 degrees C). Grease a cast-iron skillet with olive oil. 4. Lightly flour a work surface and set the dough on top. Cut dough in half and roll out one half as thin as possible into a large rectangle. Cut dough first into strips, then into 20 small rectangles, about 1.5 x 1.75 inches each. Reserve dough scraps in case there is left over filling to make extra manti. Repeat with second half. 5. Use a teaspoon to portion out the filling, about 1/2 to 1 teaspoon per manti, and set into the middle of each dough rectangle (you can also use your hands to portion out the filling as shown in the video). 6. Moisten the outer, shorter edges of each rectangle with a little bit of water on your fingertips, pick up a rectangle, and trap the filling inside by pinching both ends of the dough together, creating the classic \"little man in the boat\" design. Press dumpling together so manti will sit up straight in the skillet, making sure the dough at the ends is as thin as it is around the filling. 7. Set manti inside the prepared skillet in such a way that there is still a little room between the dumplings as the dough will expand to about twice its size during cooking. 8. Bake in the preheated oven on the center rack for 40 minutes. 9. Meanwhile, heat olive oil in a pot over medium-high heat and cook garlic until fragrant, 20 to 30 seconds. Add tomato sauce and stir quickly. Add chicken broth and season with salt, pepper, and cayenne. 10. Bring tomato broth to a simmer and turn off the heat. 11. Ladle tomato broth over the manti and return to the oven for 15 more minutes.",
  "prep": "40 mins",
  "cook": "",
  "total": "2 hrs 5 mins",
  "calories": "257"
},
{
  "url": "https://www.allrecipes.com/recipe/84270/slow-cooker-corned-beef-and-cabbage/",
  "name": "Slow-Cooker Corned Beef and Cabbage",
  "rating": "4.6",
  "ratingcount": "2",
  "ingredients": "10  baby red potatoes, quartered; 4 large carrots, peeled and cut into matchstick pieces; 1  onion, peeled and cut into bite-sized pieces; 4 cups water; 1 (4 pound) corned beef brisket with spice packet; 6 ounces beer; ½ head cabbage, coarsely chopped",
  "directions": "1. Place potatoes, carrots, and onion into the bottom of a slow cooker; add water and place brisket on top of vegetables. Pour beer over brisket; sprinkle over spices from the packet and cover. 2. Cook on High for 7 hours; stir in the cabbage and cook for 1 more hour.",
  "prep": "15 mins",
  "cook": "8 hrs",
  "total": "8 hrs 15 mins",
  "calories": "473"
},
{
  "url": "https://www.allrecipes.com/recipe/221958/chef-johns-perfect-prime-rib/",
  "name": "Chef John's Perfect Prime Rib",
  "rating": "4.8",
  "ratingcount": "2",
  "ingredients": "1 (4 pound) prime rib roast; ¼ cup unsalted butter, softened; 1 tablespoon freshly ground black pepper; 1 teaspoon herbes de Provence; kosher salt to taste",
  "directions": "1. Place prime rib roast on a plate and bring to room temperature, 2 to 4 hours. 2. Preheat the oven to 500 degrees F (260 degrees C). 3. Combine butter, pepper, and herbes de Provence in a bowl; mix until well blended. Spread butter mixture evenly over entire roast. Season roast generously with kosher salt. 4. Roast the 4-pound roast in the preheated oven for 20 minutes. (If your roast is larger or smaller than 4 pounds, multiply the exact weight times 5 minutes.) 5. Turn the oven off and, leaving the roast in the oven with the door closed, let the roast sit in the oven for 2 hours. 6. Remove roast from the oven, slice, and serve.",
  "prep": "10 mins",
  "cook": "2 hrs 20 mins",
  "total": "4 hrs 30 mins",
  "calories": "1757"
},
{
  "url": "https://www.allrecipes.com/recipe/16310/corned-beef-and-cabbage-i/",
  "name": "Corned Beef and Cabbage",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "1 (3 pound) corned beef brisket with spice packet; 10 small red potatoes; 5 medium carrots; 1 large head cabbage",
  "directions": "1. Gather all ingredients. 2. Place corned beef in a Dutch oven and cover with water. Add spice packet, cover, and bring to a boil. Reduce heat and simmer until corned beef is just about fork-tender, about 2 hours. 3. While the corned beef is simmering, cut potatoes in half. Peel carrots and cut into 3-inch pieces. Cut cabbage into small wedges. 4. When corned beef has cooked for 2 hours, add potatoes and carrots; cook until vegetables are almost tender and meat is fork-tender, about 10 minutes. Add cabbage and cook until tender, about 15 more minutes. 5. Remove meat and let rest for 15 minutes. Leave broth and vegetables in the Dutch oven.Slice meat across the grain. Serve with vegetables and broth.",
  "prep": "",
  "cook": "2 hrs 30 mins",
  "total": "2 hrs 30 mins",
  "calories": "839"
}]